app/Http/Controllers/ak_kurikulum_pl_Controller.php

select `ak_kurikulum_pls`.*, `ak_kurikulum`.`kdkurikulum`, `ak_kurikulum`.`kurikulum`, `ak_kurikulum`.`tahun` from `ak_kurikulum_pls` left join `ak_kurikulum` on `ak_kurikulum_pls`.`kdkurikulum` = `ak_kurikulum`.`kdkurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) order by `ak_kurikulum_pls`.`id` asc limit 10 offset 0
select count(*) as aggregate from `ak_kurikulum_pls` left join `ak_kurikulum` on `ak_kurikulum_pls`.`kdkurikulum` = `ak_kurikulum`.`kdkurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0)
select * from `ak_kurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) and `isObe` = 1
---
    public function index(Request $request)
    {
        // $akKurikulumPl = ak_kurikulum_pl::all();

        if (auth()->user()->kdunit == 100 || auth()->user()->kdunit == 0 || auth()->user()->kdunit == 42) {
            $akKurikulumPl = DB::table('ak_kurikulum_pls')
                ->select("ak_kurikulum_pls.*", "ak_kurikulum.kdkurikulum", "ak_kurikulum.kurikulum", "ak_kurikulum.tahun")
                ->leftJoin("ak_kurikulum", "ak_kurikulum_pls.kdkurikulum", "=", "ak_kurikulum.kdkurikulum")
                ->orderBy(('ak_kurikulum_pls.id'))
                ->paginate(10);

            $kdkurikulum = DB::table("ak_kurikulum")
                ->where("isObe", "=", 1)
                ->get();
        } else {
            $akKurikulumPl = DB::table('ak_kurikulum_pls')
                ->select("ak_kurikulum_pls.*", "ak_kurikulum.kdkurikulum", "ak_kurikulum.kurikulum", "ak_kurikulum.tahun")
                ->leftJoin("ak_kurikulum", "ak_kurikulum_pls.kdkurikulum", "=", "ak_kurikulum.kdkurikulum")
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);
                })
                ->orderBy(('ak_kurikulum_pls.id'))
                ->paginate(10);

            $kdkurikulum = DB::table("ak_kurikulum")
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);
                })
                ->where("isObe", "=", 1)
                ->get();

select `kdkurikulum`, `kurikulum`, `tahun` from `ak_kurikulum` where `kdunitkerja` = 41 and `isObe` = 1
---
    public function create()
    {
        $unit = DB::table('ak_kurikulum')
            ->select(['kdkurikulum', 'kurikulum', 'tahun'])
            ->where('kdunitkerja', '=', auth()->user()->kdunit)
            ->where("isObe", '=', 1)
            ->get();