app/Http/Controllers/ak_kurikulum_bk_controller.php

select `ak_kurikulum_bks`.*, `ak_kurikulum_basis_ilmus`.`basis_ilmu` as `ak_basil`, `ak_kurikulum_bidang_ilmus`.`bidang_ilmu` as `ak_bidil`, `ak_kurikulum`.`kurikulum`, `ak_kurikulum`.`tahun` from `ak_kurikulum_bks` inner join `ak_kurikulum_basis_ilmus` on `ak_kurikulum_basis_ilmus`.`id` = `ak_kurikulum_bks`.`kdbasil` inner join `ak_kurikulum_bidang_ilmus` on `ak_kurikulum_bidang_ilmus`.`id` = `ak_kurikulum_bks`.`kdbidil` inner join `ak_kurikulum` on `ak_kurikulum`.`kdkurikulum` = `ak_kurikulum_bks`.`kdkurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) limit 10 offset 0
select count(*) as aggregate from `ak_kurikulum_bks` inner join `ak_kurikulum_basis_ilmus` on `ak_kurikulum_basis_ilmus`.`id` = `ak_kurikulum_bks`.`kdbasil` inner join `ak_kurikulum_bidang_ilmus` on `ak_kurikulum_bidang_ilmus`.`id` = `ak_kurikulum_bks`.`kdbidil` inner join `ak_kurikulum` on `ak_kurikulum`.`kdkurikulum` = `ak_kurikulum_bks`.`kdkurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0)
select * from `ak_kurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) and `isObe` = 1
---
                )
                ->join(
                    "ak_kurikulum_basis_ilmus",
                    "ak_kurikulum_basis_ilmus.id",
                    "=",
                    "ak_kurikulum_bks.kdbasil"
                )
                ->join(
                    "ak_kurikulum_bidang_ilmus",
                    "ak_kurikulum_bidang_ilmus.id",
                    "=",
                    "ak_kurikulum_bks.kdbidil"
                )
                ->join(
                    "ak_kurikulum",
                    "ak_kurikulum.kdkurikulum",
                    "=",
                    "ak_kurikulum_bks.kdkurikulum"
                )
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);
                })
                ->paginate(10);

            $kdkurikulum = DB::table("ak_kurikulum")
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);
                })
                ->where("isObe", "=", 1)
                ->get();

select `id`, `basis_ilmu` from `ak_kurikulum_basis_ilmus`
select `id`, `bidang_ilmu` from `ak_kurikulum_bidang_ilmus`
select `kdkurikulum`, `kurikulum`, `tahun` from `ak_kurikulum` where `kdunitkerja` = 41 and `isObe` = 1
---
    public function create()
    {
        $akKurikulumBasil = DB::table('ak_kurikulum_basis_ilmus')
            ->select(['id', 'basis_ilmu'])
            ->get();
        $akKurikulumBidil = DB::table('ak_kurikulum_bidang_ilmus')
            ->select(['id', 'bidang_ilmu'])
            ->get();
        $akKurikulum = DB::table('ak_kurikulum')
            ->select(['kdkurikulum', 'kurikulum', 'tahun'])
            ->where('kdunitkerja', '=', auth()->user()->kdunit)
            ->where("isObe", '=', 1)
            ->get();