app/Http/Controllers/ak_matakuliah_controller.php

select `ak_matakuliah`.*, `ak_matakuliah_ak_kurikulum_sub_bk`.`kdmatakuliah` as `pivot_kdmatakuliah`, `ak_matakuliah_ak_kurikulum_sub_bk`.`ak_kurikulum_sub_bk_id` as `pivot_ak_kurikulum_sub_bk_id`, `ak_matakuliah_ak_kurikulum_sub_bk`.`id` as `pivot_id` from `ak_matakuliah` inner join `ak_matakuliah_ak_kurikulum_sub_bk` on `ak_matakuliah`.`kdmatakuliah` = `ak_matakuliah_ak_kurikulum_sub_bk`.`ak_kurikulum_sub_bk_id` where `ak_matakuliah_ak_kurikulum_sub_bk`.`kdmatakuliah` in (4, 5)
select count(*) as aggregate from `ak_matakuliah` inner join `ak_kurikulum` on `ak_kurikulum`.`kdkurikulum` = `ak_matakuliah`.`kdkurikulum` where `ak_kurikulum`.`isObe` = 1 and (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0)
select * from `ak_matakuliah` inner join `ak_kurikulum` on `ak_kurikulum`.`kdkurikulum` = `ak_matakuliah`.`kdkurikulum` where `ak_kurikulum`.`isObe` = 1 and (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) order by `kdmatakuliah` asc limit 10 offset 0
select * from `ak_kurikulum` where (`ak_kurikulum`.`kdunitkerja` = 41 or `ak_kurikulum`.`kdunitkerja` = 0) and `isObe` = 1
---
    public function mkIndex(Request $request)
    {

        if (auth()->user()->kdunit == 100 || auth()->user()->kdunit == 0 || auth()->user()->kdunit == 42) {
            $matakuliah = ak_matakuliah::with('MKtoSub_bk.SBKtoidCPMK', 'MKtoSub_bk.getSBKtoidCPMK', 'GetAllidSubBK')
                ->join('ak_kurikulum', 'ak_kurikulum.kdkurikulum', '=', 'ak_matakuliah.kdkurikulum')
                ->where("ak_kurikulum.isObe", '=', 1)
                ->orderBy('kdmatakuliah', 'asc')
                ->paginate(10);

            $kdkurikulum = DB::table("ak_kurikulum")
                ->where("isObe", "=", 1)
                ->get();
        } else {
            $matakuliah = ak_matakuliah::with('MKtoSub_bk.SBKtoidCPMK', 'MKtoSub_bk.getSBKtoidCPMK', 'GetAllidSubBK')
                ->join('ak_kurikulum', 'ak_kurikulum.kdkurikulum', '=', 'ak_matakuliah.kdkurikulum')
                ->where("ak_kurikulum.isObe", '=', 1)
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);
                })
                ->orderBy('kdmatakuliah', 'asc')
                ->paginate(10);

            $kdkurikulum = DB::table("ak_kurikulum")
                ->where(function ($query) {
                    $query->where("ak_kurikulum.kdunitkerja", '=', Auth::user()->kdunit)
                        ->orWhere("ak_kurikulum.kdunitkerja", '=', 0);

select `kdkurikulum`, `kurikulum`, `tahun` from `ak_kurikulum` where `kdunitkerja` = 41 and `isObe` = 1
select `id`, `kode_subbk`, `sub_bk` from `ak_kurikulum_sub_bks` inner join `ak_kurikulum` on `ak_kurikulum`.`kdkurikulum` = `ak_kurikulum_sub_bks`.`kdkurikulum` where `kdunitkerja` = 41
---
    public function mkCreate()
    {
        $ak_kurikulum = DB::table('ak_kurikulum')
            ->select(['kdkurikulum', 'kurikulum', 'tahun'])
            ->where('kdunitkerja', '=', auth()->user()->kdunit)
            ->where("isObe", '=', 1)
            ->get();

        $SBK = DB::table('ak_kurikulum_sub_bks')
            ->select(['id', 'kode_subbk', 'sub_bk'])
            ->join(
                "ak_kurikulum",
                "ak_kurikulum.kdkurikulum",
                "=",
                "ak_kurikulum_sub_bks.kdkurikulum"
            )
            ->where('kdunitkerja', '=', auth()->user()->kdunit)
            ->get();